/***********************************************************************************************************************
* file           : microsec.h
* author         : --
* version        : --
* date           : 2014-9-1
* brief          : Header for microsec.c module
***********************************************************************************************************************/

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef __MICROSEC_H
#define __MICROSEC_H

 

/* Includes  == 文件包含 ---------------------------------------------------------------------------------------------*/
#include "stm32f10x.h"



/* Private typedef    ==  私有类型 -----------------------------------------------------------------------------------*/
/* Private define     ==  私有定义------------------------------------------------------------------------------------*/
typedef long long s64;
typedef unsigned long long u64;
/*-----------------------------------------------------------------*/



/* Private macro      ==  私有宏 -------------------------------------------------------------------------------------*/
/* Private variables  ==  私有变量 -----------------------------------------------------------------------------------*/



/* Private function prototypes  ==  私有函数声明 ---------------------------------------------------------------------*/
void	MICROSEC_Init(void);
void	MICROSEC_Tim_Config(void);
s64	MICROSEC_GetTime(void);
void	MICROSEC_Delay_ms(s64 tim);
void	MICROSEC_Delay_us(s64 tim);
void	MICROSEC_NVIC_Config(void);
void	D_MICROSEC_HighTimeIRQHandler(void);



/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#endif /* __MICROSEC_H */




/*********************************  COPYRIGHT 2014 --------  *********  END OF FILE  **********************************/
