/******************************************************************************
* 文 件  名 称:BspAD5410.h
* 文件功能概述:实现AD5410驱动接口声明
* 文 件  作 者:
* 版        本:V1.0.0.0
* 修 订  记 录:2017-6-30创建
******************************************************************************/
 
#ifndef __BSP_AD5410_H__
#define __BSP_AD5410_H__
 
 
/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/
#include "main.h"
/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/
/************************************************************************************************
*AD5410的数据是按照24位宽组织的
*DB23~DB16 ：地址字节
*DB15~DB0  ：数据字
************************************************************************************************/
 
/*****************************地址字节功能定义***************************************************/
#define ADDR_FUNC_NOP          0x00
#define ADDR_FUNC_DATA_REG     0x01
#define ADDR_FUNC_CTRL_REG     0x55
#define ADDR_FUNC_RST_REG      0x56
                               
#define ADDR_FUNC_READBACK     0x02
/*****************************地址字节功能定义结束***************************************************/
 
/*****************************回读数据时的读取地址定义  占用DB1~DB0***************************************************/
#define READBACK_REG_MASK      0x03
 
#define READBACK_STATUS_REG    0x00
#define READBACK_DATA_REG      0x01
#define READBACK_CTRL_REG      0x02
/*****************************回读数据时的读取地址定义结束***************************************************/
 
#define NOP_OPERATION          0x000000      //空操作
 
/*****************************控制寄存器定义***************************************************/
#define CTRL_RANG_MASK         0x07          //输出范围掩码
#define CTRL_4_20_RANG         0x05          //4-20mA输出范围
#define CTRL_0_20_RANG         0x06          //0-20mA输出范围
#define CTRL_0_24_RANG         0x07          //0-24mA输出范围
 
#define CTRL_DCEN_ENABLE        (0 << 3)      //菊花链使能
 
#define CTRL_SREN_ENABLE        (1 << 4)      //数字压摆率使能
 
#define CTRL_OUTEN_ENABLE       (1 << 11)     //使能输出
 
#define CTRL_REXT_ENABLE        (1 << 12)     //外部电阻选择
/*****************************控制寄存器定义结束***************************************************/
 
#define RST_REG_ENABLE          (1 << 0)       //软件复位
 
#define AD5410_RATIO (0xFFF)
 
/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/
typedef enum
{
  E_AD5410_REG_ADDR_STATUS,
  E_AD5410_REG_ADDR_DATA,
  E_AD5410_REG_ADDR_CTRL
}E_AD5410_REG_ADDR; 
 
typedef enum
{
  E_AD5410_1 = 0x00,
  E_AD5410_2,
  
  E_AD5410_Max,
  
  E_AD5410_Invalid
}E_AD5410;
/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/
 
/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/
 
/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/
 
/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/
 
/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/
//uint8_t AD5410xInit(E_AD5410 eAD5410);
// 
//uint8_t AD5410xWrite(E_AD5410 E_AD5410, uint8_t reg, uint16_t data);
// 
//uint8_t AD5410xWriteCtrlReg(E_AD5410 E_AD5410, uint16_t data);
// 
//uint8_t AD5410xWriteDataReg(E_AD5410 E_AD5410, uint16_t data);
// 
//uint8_t AD5410xRead(E_AD5410 E_AD5410, E_AD5410_REG_ADDR RegAddr, uint16_t *data);
// 
//uint8_t AD5410xReadDataReg(E_AD5410 E_AD5410, uint16_t *data);
// 
//uint16_t AD5410xValueToCurrent(float value, float MaxValue);
 
#endif

