#ifndef TM7780_H_
#define TM7780_H_
#include "stc8h1k.h"


//--------------------------------------------------------------------------------------------


/*=============================================================================
  * File Name	     : TM7780参考例程
  * Describe 	     : 测量功率、电压、电流及电量参数
  * Version	     : V1.0
  * Record	     : 2014/04/10
=============================================================================*/
/* Includes -----------------------------------------------------------------*/

//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
//Time1定时器定时,时间基数 = 1ms
#define D_TIME1_20MS				20
#define D_TIME1_100MS				100
#define D_TIME1_150MS				150
#define D_TIME1_200MS				200
#define D_TIME1_400MS				400
#define D_TIME1_500MS				500
#define D_TIME1_1S				1000		//Time1定时器定时1S时间常数
#define D_TIME1_2S				2000
#define D_TIME1_3S				2000
#define D_TIME1_4S				4000
#define D_TIME1_6S				6000
#define D_TIME1_8S				8000
#define D_TIME1_9S				9000
#define D_TIME1_10S				10000
#define D_TIME1_20S				20000


#define D_TIME1_V_OVERFLOW                      500        //Time1定时器,电压溢出常数设定为500mS,溢出说明脉宽周期大于500mS
#define D_TIME1_I_OVERFLOW			8000	   //Time1定时器,电流溢出常数设定为10S,溢出说明脉宽周期大于10S
#define D_TIME1_P_OVERFLOW			12000	   //Time1定时器,功率溢出常数设定为10S(约0.5W最小值),溢出说明脉宽周期大于10S
//#define D_TIME1_P_OVERFLOW			40000	   //Time1定时器,功率溢出常数设定为40S(约0.2W最小值)
#define D_TIME1_CAL_TIME			36000	   //校正时间，记录在此时间内的脉冲数，1000W负载在用电36S时间内耗费0.01度电
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------



//HLW 8012 IO设置
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
#define IO_TM7780_CF1_S      TM7780_SET		//TM7780 PIN8		
#define IO_TM7780_CF1        TM7780_CFA		//TM7780 PIN7	
#define IO_TM7780_CF         TM7780_CF		//TM7780 PIN6
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------


//工作模式
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------
#define D_ERR_MODE                	0x00        //错误提示模式
#define D_NORMAL_MODE		      	0x10	    //正常工作模式
#define D_CAL_START_MODE		    0x21	    //校正模式，启动
#define D_CAL_END_MODE		        0x23	    //校正模式，完成
//--------------------------------------------------------------------------------------------
//--------------------------------------------------------------------------------------------



//ROM定义
//--------------------------------------------------------------------------------------------

#define ADDR_BASE   0x0400
#define ADDR_OFFSET 0x04
#define ADDR_CAL_FLAG   ADDR_BASE
#define ADDR_REF_P_PLUSEWIDTH_TIME (ADDR_BASE + 1)
#define ADDR_REF_V_PLUSEWIDTH_TIME (ADDR_BASE + 5)
#define ADDR_REF_I_PLUSEWIDTH_TIME (ADDR_BASE + 9)
#define ADDR_REF_001_E (ADDR_BASE + 13)
#define ADDR_AC_BACKUP_E (ADDR_BASE + 15)



//--------------------------------------------------------------------------------------------

typedef struct
{
    u16 	U16_AC_P;				//功率值 1000.0W
    u16 	U16_AC_V;				//电压值 220.0V
    u16 	U16_AC_I;				//电流值 4.545A
    u32 	U32_AC_E;				//用电量   0.01度
    u8    tm_cfi_edge;       //上升沿标志位
    u8    tm_cfv_edge;
    u8	  tm_cfp_edge;
    u32   tm_cfi_cnt;       //上升沿标志位
    u32   tm_cav_cnt;
    u32	  tm_cfp_cnt;
    u16   time_1s;
} power_stru;

void tm7780_init(void);
void tm7780_proc(void);
power_stru *get_power(void);
void VI_Interrupt(void);
void P_Interrupt(void);

#endif

